Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2025DAS169.atdf
         <register caption="" name="GLCDCURDATA73" offset="0x924" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1815" />
            <bitfield mask="0x000000F0" name="PIXEL1814" />
            <bitfield mask="0x00000F00" name="PIXEL1813" />
            <bitfield mask="0x0000F000" name="PIXEL1812" />
            <bitfield mask="0x000F0000" name="PIXEL1811" />
            <bitfield mask="0x00F00000" name="PIXEL1810" />
            <bitfield mask="0x0F000000" name="PIXEL189" />
            <bitfield mask="0xF0000000" name="PIXEL188" />
         </register>
         <register caption="" name="GLCDCURDATA74" offset="0x928" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1823" />
            <bitfield mask="0x000000F0" name="PIXEL1822" />
            <bitfield mask="0x00000F00" name="PIXEL1821" />
            <bitfield mask="0x0000F000" name="PIXEL1820" />
            <bitfield mask="0x000F0000" name="PIXEL1819" />
            <bitfield mask="0x00F00000" name="PIXEL1818" />
            <bitfield mask="0x0F000000" name="PIXEL1817" />
            <bitfield mask="0xF0000000" name="PIXEL1816" />
         </register>
         <register caption="" name="GLCDCURDATA75" offset="0x92C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1831" />
            <bitfield mask="0x000000F0" name="PIXEL1830" />
            <bitfield mask="0x00000F00" name="PIXEL1829" />
            <bitfield mask="0x0000F000" name="PIXEL1828" />
            <bitfield mask="0x000F0000" name="PIXEL1827" />
            <bitfield mask="0x00F00000" name="PIXEL1826" />
            <bitfield mask="0x0F000000" name="PIXEL1825" />
            <bitfield mask="0xF0000000" name="PIXEL1824" />
         </register>
         <register caption="" name="GLCDCURDATA76" offset="0x930" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL197" />
            <bitfield mask="0x000000F0" name="PIXEL196" />
            <bitfield mask="0x00000F00" name="PIXEL195" />
            <bitfield mask="0x0000F000" name="PIXEL194" />
            <bitfield mask="0x000F0000" name="PIXEL193" />
            <bitfield mask="0x00F00000" name="PIXEL192" />
            <bitfield mask="0x0F000000" name="PIXEL191" />
            <bitfield mask="0xF0000000" name="PIXEL190" />
         </register>
         <register caption="" name="GLCDCURDATA77" offset="0x934" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1915" />
            <bitfield mask="0x000000F0" name="PIXEL1914" />
            <bitfield mask="0x00000F00" name="PIXEL1913" />
            <bitfield mask="0x0000F000" name="PIXEL1912" />
            <bitfield mask="0x000F0000" name="PIXEL1911" />
            <bitfield mask="0x00F00000" name="PIXEL1910" />
            <bitfield mask="0x0F000000" name="PIXEL199" />
            <bitfield mask="0xF0000000" name="PIXEL198" />
         </register>
         <register caption="" name="GLCDCURDATA78" offset="0x938" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1923" />
            <bitfield mask="0x000000F0" name="PIXEL1922" />
            <bitfield mask="0x00000F00" name="PIXEL1921" />
            <bitfield mask="0x0000F000" name="PIXEL1920" />
            <bitfield mask="0x000F0000" name="PIXEL1919" />
            <bitfield mask="0x00F00000" name="PIXEL1918" />
            <bitfield mask="0x0F000000" name="PIXEL1917" />
            <bitfield mask="0xF0000000" name="PIXEL1916" />
         </register>
         <register caption="" name="GLCDCURDATA79" offset="0x93C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1931" />
            <bitfield mask="0x000000F0" name="PIXEL1930" />
            <bitfield mask="0x00000F00" name="PIXEL1929" />
            <bitfield mask="0x0000F000" name="PIXEL1928" />
            <bitfield mask="0x000F0000" name="PIXEL1927" />
            <bitfield mask="0x00F00000" name="PIXEL1926" />
            <bitfield mask="0x0F000000" name="PIXEL1925" />
            <bitfield mask="0xF0000000" name="PIXEL1924" />
         </register>
         <register caption="" name="GLCDCURDATA80" offset="0x940" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL207" />
            <bitfield mask="0x000000F0" name="PIXEL206" />
            <bitfield mask="0x00000F00" name="PIXEL205" />
            <bitfield mask="0x0000F000" name="PIXEL204" />
            <bitfield mask="0x000F0000" name="PIXEL203" />
            <bitfield mask="0x00F00000" name="PIXEL202" />
            <bitfield mask="0x0F000000" name="PIXEL201" />
            <bitfield mask="0xF0000000" name="PIXEL200" />
         </register>
         <register caption="" name="GLCDCURDATA81" offset="0x944" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2015" />
            <bitfield mask="0x000000F0" name="PIXEL2014" />
            <bitfield mask="0x00000F00" name="PIXEL2013" />
            <bitfield mask="0x0000F000" name="PIXEL2012" />
            <bitfield mask="0x000F0000" name="PIXEL2011" />
            <bitfield mask="0x00F00000" name="PIXEL2010" />
            <bitfield mask="0x0F000000" name="PIXEL209" />
            <bitfield mask="0xF0000000" name="PIXEL208" />
         </register>
         <register caption="" name="GLCDCURDATA82" offset="0x948" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2023" />
            <bitfield mask="0x000000F0" name="PIXEL2022" />
            <bitfield mask="0x00000F00" name="PIXEL2021" />
            <bitfield mask="0x0000F000" name="PIXEL2020" />
            <bitfield mask="0x000F0000" name="PIXEL2019" />
            <bitfield mask="0x00F00000" name="PIXEL2018" />
            <bitfield mask="0x0F000000" name="PIXEL2017" />
            <bitfield mask="0xF0000000" name="PIXEL2016" />
         </register>
         <register caption="" name="GLCDCURDATA83" offset="0x94C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2031" />
            <bitfield mask="0x000000F0" name="PIXEL2030" />
            <bitfield mask="0x00000F00" name="PIXEL2029" />
            <bitfield mask="0x0000F000" name="PIXEL2028" />
            <bitfield mask="0x000F0000" name="PIXEL2027" />
            <bitfield mask="0x00F00000" name="PIXEL2026" />
            <bitfield mask="0x0F000000" name="PIXEL2025" />
            <bitfield mask="0xF0000000" name="PIXEL2024" />
         </register>
         <register caption="" name="GLCDCURDATA84" offset="0x950" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL217" />
            <bitfield mask="0x000000F0" name="PIXEL216" />
            <bitfield mask="0x00000F00" name="PIXEL215" />
            <bitfield mask="0x0000F000" name="PIXEL214" />
            <bitfield mask="0x000F0000" name="PIXEL213" />
            <bitfield mask="0x00F00000" name="PIXEL212" />
            <bitfield mask="0x0F000000" name="PIXEL211" />
            <bitfield mask="0xF0000000" name="PIXEL210" />
         </register>
